eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
  // const char* subprotocols[] = {}; // THIS LINE SHOULD BE REMOVED/COMMENTED
  // webSocket.setSubprotocols(subprotocols, 0); // THIS LINE SHOULD BE REMOVED/COMMENTED

  // Set a browser-like User-Agent.
  // The library will send its default Sec-WebSocket-Protocol: arduino.
  // webSocket.setUserAgent("Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.93 Safari/537.36 ESP32WebSocketClient");

  // Connect to WSS (WebSocket Secure) server.
  // For production systems with public CAs (like Let's Encrypt), this should work.
  // If connection issues occur with SSL, you might need to provide a root CA certificate
  // or a fingerprint, e.g., webSocket.beginSSL(wsHost, wsPort, wsPath, "/path_to_ca_cert_on_fs", "fingerprint");
  // However, for many common CAs, the ESP32's underlying stack may handle it.
  webSocket.begin(wsHost, wsPort, wsPath);
  webSocket.onEvent(webSocketEvent);
  webSocket.setReconnectInterval(5000); // Already set via const but can be set here too
  // Optional: for SSL, if your server uses a self-signed cert or you want to pin.
  // webSocket.setFingerprint("...");
}

/**
 * @brief Sends the current system configuration (servo limits, timers) to the WebSocket client.
 *
 * Constructs a JSON message containing the type "systemConfig", the current values of
 * minX, maxX, minY, maxY, and an array of all configured timers. Each timer object
 * in the array includes its startTimeMinutes and stopTimeMinutes.
 * This message is then sent to the connected WebSocket client.
 */
void sendSystemConfig() {
    if (!webSocketConnected) {
        Serial.println("Cannot send system config, WebSocket not connected.");
        return;
    }

    StaticJsonDocument<768> doc; // Adjusted size for system config
    doc["type"] = "systemConfig";

    JsonObject config = doc.createNestedObject("config");
    config["minX"] = minX;
    config["maxX"] = maxX;
    config["minY"] = minY;
    config["maxY"] = maxY;

    JsonArray timersArray = config.createNestedArray("timers");
    for (int i = 0; i < numTimeSlots; i++) {
        JsonObject timer = timersArray.createNestedObject();
        timer["startTimeMinutes"] = timeSlots[i].startTimeMinutes;
        timer["stopTimeMinutes"] = timeSlots[i].stopTimeMinutes;
        // 'active' field is mostly for internal ESP32 logic, not usually sent to client here
        // but can be added if client needs to know raw 'active' state from struct.
    }

    String output;
    serializeJson(doc, output);
    webSocket.sendTXT(output);
    Serial.println("Sent systemConfig: " + output);
}

void saveTimersToPreferences() {
  preferences.begin("servo_config", false); // Begin the session here, non-read-only

  preferences.putInt("num_timers", numTimeSlots);
  Serial.printf("Saved num_timers: %d\n", numTimeSlots);
  // Serial.printf("Read back num_timers: %d\n", preferences.getInt("num_timers", -99)); // Optional: Verification

  for (int i = 0; i < numTimeSlots; i++) {
    String startKey = "timer_" + String(i) + "_start";
    String stopKey = "timer_" + String(i) + "_stop";

    preferences.putInt(startKey.c_str(), timeSlots[i].startTimeMinutes);
    // Serial.printf("Saved %s: %d\n", startKey.c_str(), timeSlots[i].startTimeMinutes);
    // Serial.printf("Read back %s: %d\n", startKey.c_str(), preferences.getInt(startKey.c_str(), -99)); // Optional

    preferences.putInt(stopKey.c_str(), timeSlots[i].stopTimeMinutes);
    // Serial.printf("Saved %s: %d\n", stopKey.c_str(), timeSlots[i].stopTimeMinutes);
    // Serial.printf("Read back %s: %d\n", stopKey.c_str(), preferences.getInt(stopKey.c_str(), -99)); // Optional
  }

  preferences.end(); // End the session here
  Serial.println("Timers saved to Preferences.");
}

void addTimeSlot(String startTimeStr, String stopTimeStr) {
  if (numTimeSlots < MAX_TIMERS) {
    int startTimeMinutes = timeToMinutes(startTimeStr);
    int stopTimeMinutes = timeToMinutes(stopTimeStr);
    timeSlots[numTimeSlots].startTimeMinutes = startTimeMinutes;
    timeSlots[numTimeSlots].stopTimeMinutes = stopTimeMinutes;
    timeSlots[numTimeSlots].active = false; // Ensure new timers are initially inactive
    numTimeSlots++; // Increment numTimeSlots FIRST
    saveTimersToPreferences(); // Now save with the updated count
    Serial.printf("Added new timeslot. Total slots: %d. Start: %s, End: %s\n", numTimeSlots, startTimeStr.c_str(), stopTimeStr.c_str());
  } else {
    Serial.println("Maximum number of timers reached. Cannot add new slot.");
  }
}

void deleteTimeSlot(int indexToDelete) {
  if (indexToDelete >= 0 && indexToDelete < numTimeSlots) {
    // Shift the remaining timers to fill the gap
    for (int i = indexToDelete; i < numTimeSlots - 1; i++) {
      timeSlots[i] = timeSlots[i + 1];
    }
    // Mark the last slot as empty
    timeSlots[numTimeSlots - 1].startTimeMinutes = -1;
    timeSlots[numTimeSlots - 1].stopTimeMinutes = -1;
    numTimeSlots--;
    saveTimersToPreferences();
  } else {
    Serial.println("Invalid timer index to delete.");
  }
}



void updateDisplay() {
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);

  if (WiFi.status() == WL_CONNECTED) {
    display.print("IP: ");
    display.println(WiFi.localIP());
    display.print("Time: ");
    display.println(timeClient.getFormattedTime());
    display.setCursor(0, 16); // Move to the second half of the screen

    if (isScheduledMovementActive) {
      display.println("Scheduled movement");
      display.printf("%s - %s", currentScheduleStartTime.c_str(), currentScheduleStopTime.c_str());
    } else if (randomMotionActive) {
      display.println("Random movement");
    } else {
      display.println("Standby");
    }
  } else {
    display.println("WiFi Disconnected");
  }
  display.display();
}

// Function to start a smooth servo movement
/**
 * @brief Initiates a smooth, non-blocking movement for a specified servo.
 * @param servo The Servo object to control.
 * @param movement A reference to the ServoMovement struct tracking this servo's state.
 * @param targetPos The target position (angle) for the servo.
 * @param moveTime The total duration in milliseconds the movement should take.
 */
void startServoMovement(Servo& servo, ServoMovement &movement, int targetPos, int moveTime) {
  movement.startPos = servo.read();
  movement.targetPos = targetPos;
  movement.startTime = millis();
  movement.duration = moveTime;
  movement.isMoving = true;
}

