eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
// Function to update servo position smoothly (non-blocking)
/**
 * @brief Updates the position of a servo during a smooth movement.
 * Call this repeatedly in the loop for each servo that might be moving.
 * @param servo The Servo object to control.
 * @param movement A reference to the ServoMovement struct tracking this servo's state.
 */
void updateServoMovement(Servo& servo, ServoMovement &movement) {
  if (movement.isMoving) {
    unsigned long elapsedTime = millis() - movement.startTime;
    if (elapsedTime >= movement.duration) {
      servo.write(movement.targetPos);  // Final position
      movement.isMoving = false; // Stop the movement
    } else {
      float progress = float(elapsedTime) / movement.duration;
      int currentPos = movement.startPos + (movement.targetPos - movement.startPos) * progress;
      servo.write(int(currentPos));
    }
  }
}
// Function to test servo movement by moving it from min to max and back
void testServo(Servo& servo, int minPos, int maxPos) {
  servo.write(minPos);
  delay(1000);  // Wait for movement to complete
  servo.write(maxPos);
}

/**
 * @brief Manages random, non-blocking movements for both servos.
 *
 * When called, if enough time has passed since the last random move (defined by `movementInterval`),
 * it calculates new random target positions for both servos within their configured min/max ranges.
 * It then calculates a movement duration based on the distance to travel and initiates
 * smooth movements using `startServoMovement()`. A new random `movementInterval` is set for the next cycle.
 */
void moveServosRandomlyNonBlocking() {
    unsigned long currentMillis = millis();

    if (currentMillis - lastMotionTime >= movementInterval) {
      lastMotionTime = currentMillis;

      int currentX = myservoX.read();
      int currentY = myservoY.read();
      int randomX = random(minX, maxX + 1); // Random position for X
      int randomY = random(minY, maxY + 1); // Random position for Y

      // Calculate the distance to travel for each servo
      int distanceX = abs(randomX - currentX);
      int distanceY = abs(randomY - currentY);
      int maxDistance = max(distanceX, distanceY); // Consider the larger movement

      // Determine the movement duration based on the distance
      // You can adjust these scaling factors to control the speed
      unsigned long minMoveTime = 1000; // Minimum time for any movement
      unsigned long baseMoveTime = maxDistance * 500; // Example: 15 ms per degree
      unsigned long maxMoveTime = 3000; // Maximum allowed movement time

      int moveTimeX = constrain(baseMoveTime, minMoveTime, maxMoveTime);
      int moveTimeY = constrain(baseMoveTime, minMoveTime, maxMoveTime);

      // Start the movements
      startServoMovement(myservoX, movementX, randomX, moveTimeX);
      startServoMovement(myservoY, movementY, randomY, moveTimeY);

      // Set a new random interval for the NEXT move, possibly based on current movement
      movementInterval = random(minMotionInterval, maxMotionInterval + 1);

    }
}

// Function to display settings on OLED
void displaySettings() {
  Serial.println("Entering displaySettings()"); // Add this line
  display.clearDisplay();
  display.setCursor(0, 0);

  if (settingsMode) {
    Serial.println("settingsMode is TRUE"); // Add this line
    display.println("SETTINGS MODE");

    switch (currentSetting) {
      case 0: display.print("MinX: "); break;
      case 1: display.print("MaxX: "); break;
      case 2: display.print("MinY: "); break;
      case 3: display.print("MaxY: "); break;
    }

    switch (currentSetting) {
      case 0: display.println(minX); break;
      case 1: display.println(maxX); break;
      case 2: display.println(minY); break;
      case 3: display.println(maxY); break;
    }
  } else {
    Serial.println("settingsMode is FALSE"); // Add this line
    display.print("Servo X: "); display.println(myservoX.read());
    display.print("Servo Y: "); display.println(myservoY.read());
    if (WiFi.status() == WL_CONNECTED) {
      display.print("IP: "); display.println(WiFi.localIP());
    } else {
      display.print("Not Connected");
    }
  }
  display.display(); 
  Serial.println("Exiting displaySettings()"); // Add this line
}

// Modified adjustSettings function to use Preferences
void adjustSettings(int setting, bool increment) {
  switch (setting) {
    case 0: preferences.putInt("min_x", constrain(preferences.getInt("min_x", 0) + (increment ? 1 : -1), 0, 180)); break;
    case 1: preferences.putInt("max_x", constrain(preferences.getInt("max_x", 180) + (increment ? 1 : -1), 0, 180)); break;
    case 2: preferences.putInt("min_y", constrain(preferences.getInt("min_y", 45) + (increment ? 1 : -1), 45, 135)); break;
    case 3: preferences.putInt("max_y", constrain(preferences.getInt("max_y", 134) + (increment ? 1 : -1), 45, 135)); break;
  }
  displaySettings();
}

void readTouch() {
  static unsigned long touchStartTime1 = 0;
  static bool touchInProgress1 = false;
  static bool shortTouchProcessed1 = false;
  static bool longTouchProcessed1 = false;

  static unsigned long touchStartTime2 = 0;
  static bool touchInProgress2 = false;
  static bool shortTouchProcessed2 = false;
  static bool longTouchProcessed2 = false;

  int touchValue1 = touchRead(touchPin1);
  int touchValue2 = touchRead(touchPin2);

  // Handle Touch Pin 1 (GPIO 32) - Sleep/Wake
  if (touchValue1 < threshold) {
    if (!touchInProgress1) {
      touchStartTime1 = millis();
      touchInProgress1 = true;
      shortTouchProcessed1 = false;
      longTouchProcessed1 = false;
    } else {
      unsigned long touchDuration1 = millis() - touchStartTime1;

      if (touchDuration1 >= 10000) {
        Serial.println("Touch 1 held for 10 seconds - Restarting ESP32...");
        ESP.restart();
      }

      if (touchDuration1 >= 500 && !longTouchProcessed1 && touchDuration1 < 10000) {
        // Sleep
        Serial.println("Long Touch 1 Detected - Turning OFF laser and relay");
        Serial2.println("STOP_STREAM");
        display.clearDisplay();
        display.setCursor(0, 0);
        display.print("Powering Down...");
        display.display();
        delay(2000);
        display.ssd1306_command(SSD1306_DISPLAYOFF);
        laserActive = false;
        relayActive = false;
        digitalWrite(outputPin, LOW);
        digitalWrite(relayPin, LOW);
        randomMotionActive = false;
        longTouchProcessed1 = true;
        delay(1000);
        esp_deep_sleep_start();
      }

