eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
      if (touchDuration1 < 500 && !shortTouchProcessed1 && !laserActive && !relayActive) {
        // Wake
        Serial.println("Short Touch 1 Detected - Turning ON laser and relay");
        display.ssd1306_command(SSD1306_DISPLAYON);
        display.clearDisplay();
        display.setCursor(0, 0);
        display.print("Waking...");
        display.display();
        delay(2000);
        updateDisplay();
        laserActive = true;
        relayActive = true;
        digitalWrite(outputPin, HIGH);
        digitalWrite(relayPin, HIGH);
        shortTouchProcessed1 = true;
      }
    }
  } else {
    touchInProgress1 = false;
    shortTouchProcessed1 = false;
    longTouchProcessed1 = false;
  }

  // Handle Touch Pin 2 (GPIO 33) - Settings and Random Motion
  static int currentSetting = 0; // 0: minX, 1: maxX, 2: minY, 3: maxY
  static bool settingsMode = false;

  if (touchValue2 < threshold) {
    if (!touchInProgress2) {
      touchStartTime2 = millis();
      touchInProgress2 = true;
      shortTouchProcessed2 = false;
      longTouchProcessed2 = false;
    } else {
      unsigned long touchDuration2 = millis() - touchStartTime2;

      if (touchDuration2 >= 500 && !longTouchProcessed2) {
        // Toggle Settings Mode
        Serial.println("Long Touch 2 Detected");
        longTouchProcessed2 = true;

        settingsMode = !settingsMode;  // Toggle settings mode *FIRST*

        displaySettings();             // *THEN* update the display
        delay(50);                     // Small delay to allow display update

        if (settingsMode) {
          Serial.println("Entering settings mode.");
        } else {
          Serial.println("Exiting settings mode.");
        }
      }

      if (touchDuration2 < 500 && !shortTouchProcessed2) {
        shortTouchProcessed2 = true;
        if (!settingsMode) {
          // Toggle Random Motion
          randomMotionActive = !randomMotionActive;
          if (randomMotionActive) {
            Serial.println("Random motion is now active.");
          } else {
            Serial.println("Random motion is now inactive.");
          }
        } else {
          // Adjust Settings (using both buttons)
          if (touchValue1 < threshold) { // If Touch 1 is also pressed (decrement)
            adjustSettings(currentSetting, false); // Decrement
            Serial.print("Adjusting setting "); Serial.println(currentSetting);
          } else {  // If only Touch 2 is pressed (increment)
            adjustSettings(currentSetting, true); // Increment
            Serial.print("Adjusting setting "); Serial.println(currentSetting);
          }
          currentSetting = (currentSetting + 1) % 4; // Cycle through 0-3
          Serial.print("Next setting to adjust "); Serial.println(currentSetting);
        }
      }
    }
  } else { // Touch is released!
    touchInProgress2 = false;
    shortTouchProcessed2 = false;
    longTouchProcessed2 = false;  // Reset here!
  }
}

/**
 * @brief Main loop of the ESP32 DevKitV1 application.
 *
 * This function is executed repeatedly and handles the core logic:
 * - Handles ArduinoOTA updates.
 * - Processes WebSocket client events and reconnection logic.
 * - Reads touch pin inputs for sleep/wake and settings adjustment.
 * - Manages scheduled movements based on NTP time and configured time slots.
 * - Controls random servo movements if enabled (either by schedule or manual toggle).
 * - Updates servo positions for smooth, non-blocking movements.
 * - Updates the OLED display based on current mode (normal, settings) and status.
 * - Sends periodic status updates to the WebSocket server.
 * - Handles serial communication with the ESP32CAM (receiving status, sending commands).
 * - Manages WiFi connection using WiFiManager, attempting to reconnect if disconnected.
 * - Forwards commands received via main Serial to the ESP32CAM via Serial2.
 * - Periodically updates NTP time.
 */
void loop() {
  ArduinoOTA.handle();
  webSocket.loop();
  readTouch();

  if (!webSocketConnected && WiFi.status() == WL_CONNECTED) {
    if (millis() - webSocketLastReconnectAttempt > webSocketReconnectInterval) {
      webSocketLastReconnectAttempt = millis();
      Serial.println("Attempting to reconnect WebSocket...");
      // webSocket.begin() should ideally handle reconnection attempts if using setReconnectInterval
      // but an explicit begin call might be needed if the initial connection fails repeatedly.
      // For now, rely on setReconnectInterval and internal handling.
      // If connection drops, the library should try to reconnect.
      // If initial connect fails, this might need an explicit webSocket.connect(host,port,path) or begin again.
      // Let's assume library handles reconnects for now. If not, add explicit webSocket.connect() here.
    }
  }

  bool shouldMoveRandomlyThisCycle = false;
  String scheduledStartTime = ""; // Local variables to store the times
  String scheduledStopTime = "";

  if (timeClient.isTimeSet()) {
    String currentTime = getFormattedTime();
    int currentMinutes = timeToMinutes(currentTime);

    for (int i = 0; i < numTimeSlots; i++) {
      if (timeSlots[i].startTimeMinutes != -1 && timeSlots[i].stopTimeMinutes != -1) {
        if (timeSlots[i].startTimeMinutes < timeSlots[i].stopTimeMinutes) {
          if (currentMinutes >= timeSlots[i].startTimeMinutes && currentMinutes < timeSlots[i].stopTimeMinutes) {
            shouldMoveRandomlyThisCycle = true;
            scheduledStartTime = minutesToTime(timeSlots[i].startTimeMinutes);
            scheduledStopTime = minutesToTime(timeSlots[i].stopTimeMinutes);
            break;
          }
        } else { // Handle cases where the stop time is on the next day (e.g., 22:00 - 02:00)
          if (currentMinutes >= timeSlots[i].startTimeMinutes || currentMinutes < timeSlots[i].stopTimeMinutes) {
            shouldMoveRandomlyThisCycle = true;
            scheduledStartTime = minutesToTime(timeSlots[i].startTimeMinutes);
            scheduledStopTime = minutesToTime(timeSlots[i].stopTimeMinutes);
            break;
          }
        }
      }
    }
  }

  isScheduledMovementActive = shouldMoveRandomlyThisCycle; // Update the global state
  if (isScheduledMovementActive) {
    currentScheduleStartTime = scheduledStartTime; // Update the global start time
    currentScheduleStopTime = scheduledStopTime;   // Update the global stop time
    turnLaserOn();
  } else {
    currentScheduleStartTime = ""; // Clear the global start time when no schedule is active
    currentScheduleStopTime = "";   // Clear the global stop time when no schedule is active
  }

