eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
  // Call random movement if the schedule says it should AND it's not overridden, OR if the button is toggled ON
  if ((shouldMoveRandomlyThisCycle && !scheduledMovementOverridden) || randomMotionActive) {
    moveServosRandomlyNonBlocking(); // Call the non-blocking random movement function
    turnLaserOn();
  } else {
    if (!inConfiguration) {  turnLaserOff();}
  }

  updateServoMovement(myservoX, movementX); // Update X servo movement
  updateServoMovement(myservoY, movementY); // Update Y servo movement

  if (settingsMode) {
    displaySettings();
  } else {
    updateDisplay();
  }

  // Status Sending Logic
  static unsigned long lastStatusUpdateTime = 0;
  unsigned long statusUpdateInterval = 10000; // Send status every 10 seconds

  if (webSocketConnected && (millis() - lastStatusUpdateTime > statusUpdateInterval)) {
    lastStatusUpdateTime = millis();
    StaticJsonDocument<512> doc; // Increased size for more status data
    doc["type"] = "statusUpdate";
    // No need to send deviceId, server knows it from connection object

    JsonObject data = doc.createNestedObject("data");
    data["uptime_ms"] = millis();
    data["wifi_rssi"] = WiFi.RSSI();
    data["servoX_pos"] = myservoX.read();
    data["servoY_pos"] = myservoY.read();
    data["laser_active"] = digitalRead(outputPin) == HIGH;
    data["relay_active"] = relayActive; // relayActive is updated by RELAY_ON/OFF commands
    data["random_motion_active"] = randomMotionActive;
    data["is_scheduled_movement_active"] = isScheduledMovementActive;
    data["esp32cam_connected"] = esp32CamConnected;
    data["esp32cam_streaming"] = streaming;
    // Add servo limits to status update
    data["minX"] = minX;
    data["maxX"] = maxX;
    data["minY"] = minY;
    data["maxY"] = maxY;
    // Add other relevant status data

    String output;
    serializeJson(doc, output);
    webSocket.sendTXT(output);
    Serial.println("Sent status update: " + output);
  }

  // Read and print any data coming from the ESP32-CAM on Serial2
  if (Serial2.available() > 0) {
    String camResponse = Serial2.readStringUntil('\n');
    camResponse.trim();
    Serial.print("ESP32-CAM Response: ");
    Serial.println(camResponse);

    // Process specific responses from the ESP32-CAM
    if (!esp32CamConnected && camResponse.startsWith("IP:")) {
      esp32CamIP = camResponse.substring(3);
      Serial.print("ESP32-CAM IP Address: ");
      Serial.println(esp32CamIP);
      esp32CamConnected = true;
      Serial.println("ESP32-CAM is ready for commands.");
    } else if (!esp32CamConnected && camResponse.startsWith("ERROR:")) {
      Serial.print("ESP32-CAM Error: ");
      Serial.println(camResponse);
    }
  }

  if (wifiConnectedAP && !esp32CamConnected) {
    Serial.println("\nSending Wi-Fi credentials to ESP32-CAM (via Serial2)...");
    Serial2.println("WIFI_CREDENTIALS"); // Start marker
    Serial2.println(staSSID);
    Serial2.println(staPassword);
    Serial.println("Credentials sent.");
    wifiConnectedAP = false; // Only send once
  }

  // Wi-Fi Manager handling in loop to ensure it stays active if connection is lost
  WiFiManager wm;
  if (WiFi.status() != WL_CONNECTED && !wifiConnectedAP) {
    Serial.println("Attempting AutoConnect MiauLaser");
    if (!wm.autoConnect("MiauLaser")) {
      Serial.println("AutoConnect Failed, starting Config Portal");
      if (!wm.startConfigPortal("ESP32-Config")) {
        Serial.println("Config Portal Failed!");
        delay(3000);
        ESP.restart(); // Consider a more graceful recovery
      } else {
        Serial.println("Config Portal Running");
      }
    } else {
      Serial.println("Connected to WiFi");
      wm.setSaveConfigCallback(saveWifiCallback);
      staSSID = WiFi.SSID();
      staPassword = WiFi.psk();
      wifiConnectedAP = true;
      Serial.print("SSID: ");
      Serial.println(staSSID);
      Serial.print("Password: ");
      Serial.println(staPassword);
    }
  }

  if (esp32CamConnected) {
    while (Serial.available() > 0) {
      String command = Serial.readStringUntil('\n');
      command.trim();
      if (command == "START_STREAM" && !streaming) {
        Serial2.println(command);
        Serial.print("Sent command (via Serial2): ");
        Serial.println(command);
        streaming = true;
      } else if (command == "STOP_STREAM" && streaming) {
        Serial2.println(command);
        Serial.print("Sent command (via Serial2): ");
        Serial.println(command);
        streaming = false;
      } else if (command == "LED_ON") {
        Serial2.println(command);
        Serial.print("Sent command (via Serial2): ");
        Serial.println(command);
      } else if (command == "LED_OFF") {
        Serial2.println(command);
        Serial.print("Sent command (via Serial2): ");
        Serial.println(command);
      } else {
        Serial2.println(command); // Forward other commands
        Serial.print("Sent command (via Serial2): ");
        Serial.println(command);
      }
      delay(1);
    }
  }

  if (esp32CamConnected) {
    while (Serial.available() > 0) { // Read commands from the main Serial monitor
      String command = Serial.readStringUntil('\n');
      command.trim();
      Serial2.println(command); // Forward the command to ESP32-CAM via Serial2
      Serial.print("Sent command (via Serial2): ");
      Serial.println(command);
      delay(1); // Small delay for serial transmission
    }
  }
  if (WiFi.status() == WL_CONNECTED && millis() - lastNTPUpdateTime > ntpUpdateInterval) {
    Serial.println("Updating NTP time...");
    if (!timeClient.update()) {
      Serial.println("Failed to get NTP time.");
    } else {
      Serial.println("NTP time updated.");
      lastNTPUpdateTime = millis();
    }
  }

  delay(1); // Small delay in the main loop
}